Introducing Pandas data structures: Series, DataFrames and Index objects.

In [3]:
import pandas as pd
import numpy as np

In [4]:
days = pd.Series (["Mon","Tue","Wed","Thur","Fri"])
print(days)

0     Mon
1     Tue
2     Wed
3    Thur
4     Fri
dtype: object

In [5]:
# creating Series with a numpy array
day_list = np.array(["Mon","Tue","Wed","Thur","Fri"])
numpy_days = pd.Series (["Mon","Tue","Wed","Thur","Fri"])
print(day_list)

['Mon' 'Tue' 'Wed' 'Thur' 'Fri']

In [6]:
# create Series from a dictionary
day1 = pd.Series ({"a":"Mon", "b":"Tue",  "c":"Wed"})
print(day1)

a    Mon
b    Tue
c    Wed
dtype: object

In [8]:
# Accessing Series
days[0]

'Mon'

In [10]:
days[1:]

1     Tue
2     Wed
3    Thur
4     Fri
dtype: object

In [11]:
# print an emty data frame
print (pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [12]:
# create a dataframe from a dictionary

df_dict = {'Country':['Ghana','Kenya','Nigeria','Togo'],
          'Capital':['Accra','Naiobio','Abuja','Lome'],
          'Population':[10000,85000,35000,12000],
          'Age':[60,50,34,80]}

df = pd.DataFrame(df_dict, index=[2,4,6,8])
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Naiobio       85000   50
6  Nigeria    Abuja       35000   34
8     Togo     Lome       12000   80

In [13]:
# select the row in the at index 3
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              80
Name: 8, dtype: object

In [17]:
df['Capital']

2      Accra
4    Naiobio
6      Abuja
8       Lome
Name: Capital, dtype: object

In [18]:
df.at[6, 'Country']

'Nigeria'

In [19]:
df.iat[2,0]

'Nigeria'

In [20]:
df['Population'].sum()

142000

In [21]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   35500.000000  56.000000
std    34895.080838  19.252705
min    10000.000000  34.000000
25%    11500.000000  46.000000
50%    23500.000000  55.000000
75%    47500.000000  65.000000
max    85000.000000  80.000000

Pandas represent missing values as NA or NaN which can be filled, removed, and detected with functions like fillna(), dropna(), isnull(), notnull(), replace().

In [22]:
df_dict2={'Names':['Peter','Simen','Loveth',np.nan],
         'Profession':['contect creator','Artist','tailor','singer'],
         'Experience':[12,np.nan,5,6],
         'Height':[np.nan,164,680,100]}
new_df=pd.DataFrame(df_dict2)
new_df

    Names       Profession  Experience  Height
0   Peter  contect creator        12.0     NaN
1   Simen           Artist         NaN   164.0
2  Loveth           tailor         5.0   680.0
3     NaN           singer         6.0   100.0

In [23]:
# checking for cells with missing values as True
new_df.isnull()

   Names  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [24]:
# removing rows with Nan values
new_df.dropna()

    Names Profession  Experience  Height
2  Loveth     tailor         5.0   680.0